20260408074244-agm_scratch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-08 Wed 03:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>agm scratch</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">agm scratch</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2acf620">Slide 01 — Role &amp; Responsibilities</a>
<ul>
<li><a href="#org75cd3b2">Core Role</a></li>
<li><a href="#orge23a2f0">Day-to-Day Activities</a></li>
<li><a href="#orgd3ce489">Scope of Ownership</a></li>
</ul>
</li>
<li><a href="#orgdde9718">Slide 03 — Future Plan: 2× Revenue Strategy</a>
<ul>
<li><a href="#org47fe805">Headline Targets</a></li>
<li><a href="#org602b97c">6-Step Action Plan</a>
<ul>
<li><a href="#orgbe35e74">Step 1 — Pipeline &amp; Closure Ratio Audit</a></li>
<li><a href="#org7ed4124">Step 2 — Drop Low-Probability Deals Fast</a></li>
<li><a href="#org2acfcd2">Step 3 — TAT Reduction: 21 → =&lt;11 Days</a></li>
<li><a href="#org2f40145">Step 4 — High-Revenue Deal Focus</a></li>
<li><a href="#org6039f4c">Step 5 — Margin Push via Book &amp; Sell Model</a></li>
<li><a href="#org14101a9">Step 6 — Fast-Track Small Tickets (&lt;Rs.5L)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org84f4c8c">Slide 04 — HOW: Numbers That Define Success</a></li>
<li><a href="#org535ba23">Slide 05 — Mentorship &amp; Team Building</a>
<ul>
<li><a href="#org228cc80">1. Nurture Leaders</a></li>
<li><a href="#orgeddc66e">2. Equip with the Right Tools</a></li>
<li><a href="#org33c9820">3. Impart a Tech-Savvy Culture</a></li>
<li><a href="#orgaaa9b1e">4. How We Measure Team Performance</a></li>
</ul>
</li>
<li><a href="#org09cd749"><span class="done DONE">DONE</span> Summary: The Path to 2× Is Clear</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2acf620" class="outline-2">
<h2 id="org2acf620">Slide 01 — Role &amp; Responsibilities</h2>
<div class="outline-text-2" id="text-org2acf620">
</div>

<div id="outline-container-org75cd3b2" class="outline-3">
<h3 id="org75cd3b2">Core Role</h3>
<div class="outline-text-3" id="text-org75cd3b2">
<ul class="org-ul">
<li>End-to-end deal closure — self &amp; team</li>
<li>Process compliance &amp; quality control</li>
<li>Pipeline monitoring &amp; handover management</li>
</ul>
</div>
</div>

<div id="outline-container-orge23a2f0" class="outline-3">
<h3 id="orge23a2f0">Day-to-Day Activities</h3>
<div class="outline-text-3" id="text-orge23a2f0">
<ul class="org-ul">
<li>Cold calls → Visits → Negotiations → Closures</li>
<li>Multi-channel coordination (call / text / mail)</li>
<li>Individual &amp; team target achievement</li>
</ul>
</div>
</div>

<div id="outline-container-orgd3ce489" class="outline-3">
<h3 id="orgd3ce489">Scope of Ownership</h3>
<div class="outline-text-3" id="text-orgd3ce489">
<p>
Every deal, negotiation, site visit, and handover is executed on time,
efficiently, and per the defined process. Sales targets defined by the
organisation are met consistently by each individual and the team collectively.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdde9718" class="outline-2">
<h2 id="orgdde9718">Slide 03 — Future Plan: 2× Revenue Strategy</h2>
<div class="outline-text-2" id="text-orgdde9718">
</div>

<div id="outline-container-org47fe805" class="outline-3">
<h3 id="org47fe805">Headline Targets</h3>
<div class="outline-text-3" id="text-org47fe805">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Goal</th>
<th scope="col" class="org-left">Current</th>
<th scope="col" class="org-left">Target</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Revenue</td>
<td class="org-left">Rs.286L</td>
<td class="org-left">Rs.572L+ (2×)</td>
</tr>

<tr>
<td class="org-left">Gross Margin</td>
<td class="org-left">5–6%</td>
<td class="org-left">10%</td>
</tr>

<tr>
<td class="org-left">Average TAT</td>
<td class="org-left">21 Days</td>
<td class="org-left">=&lt;11 Days (-50%)</td>
</tr>

<tr>
<td class="org-left">Small Ticket TAT</td>
<td class="org-left">—</td>
<td class="org-left">=&lt;7 Days</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org602b97c" class="outline-3">
<h3 id="org602b97c">6-Step Action Plan</h3>
<div class="outline-text-3" id="text-org602b97c">
</div>
<div id="outline-container-orgbe35e74" class="outline-4">
<h4 id="orgbe35e74">Step 1 — Pipeline &amp; Closure Ratio Audit</h4>
<div class="outline-text-4" id="text-orgbe35e74">
<p>
Analyse current deal flow; identify conversion bottlenecks by stage.
</p>
<ul class="org-ul">
<li>Map every deal stage from cold call to closure</li>
<li>Calculate drop-off % at each stage</li>
<li>KPI: Stage-wise conversion report produced within 30 days</li>
</ul>
</div>
</div>

<div id="outline-container-org7ed4124" class="outline-4">
<h4 id="org7ed4124">Step 2 — Drop Low-Probability Deals Fast</h4>
<div class="outline-text-4" id="text-org7ed4124">
<p>
Score deals with &lt;30% turnaround probability → exit decision within =&lt;3 days
to free up team bandwidth for higher-value opportunities.
</p>
<ul class="org-ul">
<li>KPI: Zero deals sitting &gt;7 days with &lt;30% probability score</li>
</ul>
</div>
</div>

<div id="outline-container-org2acfcd2" class="outline-4">
<h4 id="org2acfcd2">Step 3 — TAT Reduction: 21 → =&lt;11 Days</h4>
<div class="outline-text-4" id="text-org2acfcd2">
<ul class="org-ul">
<li>Define stage-level SLAs (e.g., first visit within 3 days, negotiation close within 5 days)</li>
<li>Escalate stuck deals at the 7-day mark</li>
<li>KPI: Avg. TAT measured fortnightly; target =&lt;11 days by Q2</li>
</ul>
</div>
</div>

<div id="outline-container-org2f40145" class="outline-4">
<h4 id="org2f40145">Step 4 — High-Revenue Deal Focus</h4>
<div class="outline-text-4" id="text-org2f40145">
<p>
Prioritise deals &gt;=Rs.20L; same team effort, 2× revenue per closure.
</p>
<ul class="org-ul">
<li>KPI: % of pipeline &gt;=Rs.20L to increase from current mix to 50%+</li>
</ul>
</div>
</div>

<div id="outline-container-org6039f4c" class="outline-4">
<h4 id="org6039f4c">Step 5 — Margin Push via Book &amp; Sell Model</h4>
<div class="outline-text-4" id="text-org6039f4c">
<p>
Shift deal mix to 60% Book &amp; Sell to achieve 10% average margin.
</p>
<ul class="org-ul">
<li>Current margin: 5–6% (brokerage-heavy mix)</li>
<li>Book &amp; Sell adds 4–5% incremental margin per deal</li>
<li>KPI: Book &amp; Sell as % of closed deals tracked monthly</li>
</ul>
</div>
</div>

<div id="outline-container-org14101a9" class="outline-4">
<h4 id="org14101a9">Step 6 — Fast-Track Small Tickets (&lt;Rs.5L)</h4>
<div class="outline-text-4" id="text-org14101a9">
<p>
Delegate &amp; close within =&lt;7 days; reduce senior bandwidth drain.
</p>
<ul class="org-ul">
<li>Create a delegation SOP for junior team members</li>
<li>KPI: All &lt;Rs.5L deals closed within 7 days; breach flagged next day</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org84f4c8c" class="outline-2">
<h2 id="org84f4c8c">Slide 04 — HOW: Numbers That Define Success</h2>
<div class="outline-text-2" id="text-org84f4c8c">
</div>
</div>


<div id="outline-container-org535ba23" class="outline-2">
<h2 id="org535ba23">Slide 05 — Mentorship &amp; Team Building</h2>
<div class="outline-text-2" id="text-org535ba23">
</div>

<div id="outline-container-org228cc80" class="outline-3">
<h3 id="org228cc80">1. Nurture Leaders</h3>
<div class="outline-text-3" id="text-org228cc80">
<p>
Build a team of high-agency individuals who own outcomes, not just tasks.
</p>
<ul class="org-ul">
<li>Monthly 1:1 reviews tied to individual deal KPIs</li>
<li>Encourage team members to bring deal strategies, not just problems</li>
</ul>
</div>
</div>

<div id="outline-container-orgeddc66e" class="outline-3">
<h3 id="orgeddc66e">2. Equip with the Right Tools</h3>
<div class="outline-text-3" id="text-orgeddc66e">
<p>
Provide CRM access, pipeline dashboards, and deal-tracking templates
so the team focuses on selling, not admin.
</p>
<ul class="org-ul">
<li>Tools: CRM (pipeline view), Excel dashboard, WhatsApp Business, mail templates</li>
<li>Target: Zero manual follow-up tracking by end of Q2</li>
</ul>
</div>
</div>

<div id="outline-container-org33c9820" class="outline-3">
<h3 id="org33c9820">3. Impart a Tech-Savvy Culture</h3>
<div class="outline-text-3" id="text-org33c9820">
<p>
Train team on productivity tools to eliminate mundane tasks:
</p>
<ul class="org-ul">
<li>Excel dashboards for pipeline visibility</li>
<li>Mail automation for follow-up sequences</li>
<li>WhatsApp Business for customer communication tracking</li>
</ul>
</div>
</div>

<div id="outline-container-orgaaa9b1e" class="outline-3">
<h3 id="orgaaa9b1e">4. How We Measure Team Performance</h3>
<div class="outline-text-3" id="text-orgaaa9b1e">
<p>
Each team member reviewed fortnightly on:
</p>
<ul class="org-ul">
<li>Deals owned (pipeline size)</li>
<li>Conversion % (leads → closures)</li>
<li>Average TAT per deal</li>
<li>Margin per deal</li>
<li>Target achievement % vs monthly goal</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org09cd749" class="outline-2">
<h2 id="org09cd749"><span class="done DONE">DONE</span> Summary: The Path to 2× Is Clear</h2>
<div class="outline-text-2" id="text-org09cd749">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Pillar</th>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">KPI</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Revenue</td>
<td class="org-left">Focus on &gt;= rs20L deals</td>
<td class="org-left">rs572L+ this cycle</td>
</tr>

<tr>
<td class="org-left">Margin</td>
<td class="org-left">60% Book &amp; Sell mix</td>
<td class="org-left">10% avg. margin</td>
</tr>

<tr>
<td class="org-left">Speed</td>
<td class="org-left">Stage SLAs + 7-day escalation</td>
<td class="org-left">=&lt;11 days avg. TAT</td>
</tr>

<tr>
<td class="org-left">Team</td>
<td class="org-left">Fortnightly KPI reviews + tooling</td>
<td class="org-left">+20% conversion YoY</td>
</tr>

<tr>
<td class="org-left">Small Tickets</td>
<td class="org-left">Delegation SOP</td>
<td class="org-left">=&lt;7 days closure</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>